Azuralz/Azuralz/Stm32Project/10-2硬件I2C读写MPC6050/Hardware/MPU.c
#include "stm32f10x.h"                  // Device header
#include "MPU6050Reg.h"
#include "MPU.h"

#define MPUAddress  0xD0



void MPU_WriteReg(uint8_t RegAddress, uint8_t data)
{
//	MYI2C_Start();
//	MYI2C_SendByte(MPUAddress);
//	MYI2C_ReceiveAck();
//	MYI2C_SendByte(RegAddress);
//	MYI2C_ReceiveAck();
//	MYI2C_SendByte(data);
//	MYI2C_ReceiveAck();
//	MYI2C_Stop();
	
	I2C_GenerateSTART(I2C2, ENABLE);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS);
	
	I2C_Send7bitAddress(I2C2, MPUAddress, I2C_Direction_Transmitter);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) != SUCCESS);
	
	I2C_SendData(I2C2, RegAddress);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTING) != SUCCESS);
	
	I2C_SendData(I2C2, data);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS);
	
	I2C_GenerateSTOP(I2C2, ENABLE);
	
}

void MPU_WaitEvent 


uint8_t MPU_ReadReg(uint8_t RegAddress)
{
	uint8_t RegByte;
	
//	MYI2C_Start();
//	MYI2C_SendByte(MPUAddress);
//	MYI2C_ReceiveAck();
//	MYI2C_SendByte(RegAddress);
//	MYI2C_ReceiveAck();
//	
//	MYI2C_Start();
//	MYI2C_SendByte(MPUAddress | 0X01);
//	MYI2C_ReceiveAck();
//	RegByte = MYI2C_ReceiveByte();
//	MYI2C_SendAck(1);
//	MYI2C_Stop();
	I2C_GenerateSTART(I2C2, ENABLE);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS);
	
	I2C_Send7bitAddress(I2C2, MPUAddress, I2C_Direction_Transmitter);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) != SUCCESS);
	
	I2C_SendData(I2C2, RegAddress);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTING) != SUCCESS);
	
	I2C_GenerateSTART(I2C2,ENABLE);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS);
	
	I2C_Send7bitAddress(I2C2, MPUAddress, I2C_Direction_Receiver);
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED) != SUCCESS);
	
	
	I2C_AcknowledgeConfig(I2C2, DISABLE);
	I2C_GenerateSTOP(I2C2, ENABLE);
	
	while(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_RECEIVED) != SUCCESS);
	RegByte = I2C_ReceiveData(I2C2);
	
	I2C_AcknowledgeConfig(I2C2, ENABLE);
	
	return RegByte;
}

void MPU_Init(void)
{
//	MYI2C_Init();
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	I2C_InitTypeDef I2C_InitStructre;
	I2C_InitStructre.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructre.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStructre.I2C_ClockSpeed = 50000;//通讯速度
	I2C_InitStructre.I2C_DutyCycle = I2C_DutyCycle_2;//占空比高低电平比例
	I2C_InitStructre.I2C_Mode = I2C_Mode_I2C;//模式选择
	I2C_InitStructre.I2C_OwnAddress1 = 	0X00;
	I2C_Init(I2C2, &I2C_InitStructre);
	
	I2C_Cmd(I2C2, ENABLE);
	
	
	MPU_WriteReg(MPU6050_PWR_MGMT_1, 0X01);
	MPU_WriteReg(MPU6050_PWR_MGMT_2, 0X00);
	MPU_WriteReg(MPU6050_ACCEL_CONFIG, 0X09);
	MPU_WriteReg(MPU6050_CONFIG, 0X06);
	MPU_WriteReg(MPU6050_GYRO_CONFIG, 0X18);	
	MPU_WriteReg(MPU6050_ACCEL_CONFIG,0X18);
}

uint8_t MPU_GetID(void)
{
	return MPU_ReadReg(MPU6050_WHO_AM_I);
}

void MPU_GetData(MPU6050_GetValue *Data)
{
	uint8_t DataH, DataL;
	DataH = MPU_ReadReg(MPU6050_ACCEL_XOUT_H);
	DataL = MPU_ReadReg(MPU6050_ACCEL_XOUT_L);
	Data->AccX = (DataH << 8) | DataL;
	
	DataH = MPU_ReadReg(MPU6050_ACCEL_YOUT_H);
	DataL = MPU_ReadReg(MPU6050_ACCEL_YOUT_L);
	Data->AccY = (DataH << 8) | DataL;
	
	DataH = MPU_ReadReg(MPU6050_ACCEL_ZOUT_H);
	DataL = MPU_ReadReg(MPU6050_ACCEL_ZOUT_L);
	Data->AccZ = (DataH << 8) | DataL;
	
	DataH = MPU_ReadReg(MPU6050_GYRO_XOUT_H);
	DataL = MPU_ReadReg(MPU6050_GYRO_XOUT_L);
	Data->GyroX = (DataH << 8) | DataL;
	                                 
	DataH = MPU_ReadReg(MPU6050_GYRO_YOUT_H);
	DataL = MPU_ReadReg(MPU6050_GYRO_YOUT_L);
	Data->GyroY = (DataH << 8) | DataL;
	                                 
	DataH = MPU_ReadReg(MPU6050_GYRO_ZOUT_H);
	DataL = MPU_ReadReg(MPU6050_GYRO_ZOUT_L);
	Data->GyroZ = (DataH << 8) | DataL;
}
